package Lessons;
public class Lesson_1 {
    public static void main(String[] args) {
        System.out.println("hhhhhhhhhhhhhh");
    }
}
//Задачи для самоконтроля
//1. Задана натуральная степень k. Сформировать случайным
//образом список коэффициентов (значения от 0 до 100)
//многочлена многочлен степени k.
//*Пример: k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0

//2. Даны два файла, в каждом из которых находится запись
//многочлена. Сформировать файл содержащий сумму
//многочленов.